app/controllers/vehicles_controller.rb

SELECT `vehicles`.* FROM `vehicles` ORDER BY id
---
    def index
      vehicles = Vehicle.order('id')

INSERT INTO `vehicles` (`vehicle_id`, `owner`, `license_plate`, `vehicle_type`, `model`, `year`, `color`, `registry`, `picture`, `capacity`, `brand`, `service_type`, `body`, `soat_exp`, `engine`, `gas_type`, `created_at`, `updated_at`) VALUES (1, 11, 'venmo', 201, 'Goodbye Treat', 1991, 'lemon', '2021-03-31 22:55:14', 'Iure quae voluptate praesentium.', 1, 'Pabst Blue Ribbon', 'Mind Control', 'giraffe', '2020-02-18', 1471, 'gasoline', '2021-04-06 12:12:14', '2021-04-06 12:12:14')
---
    def create
      vehicle = Vehicle.new(vehicle_params)

      if vehicle.save

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 2 LIMIT 1
---
    def show
      vehicle = Vehicle.find(params[:id])

SELECT `vehicles`.* FROM `vehicles` WHERE (license_plate = NULL)
---
    def plateFiltering
      vehicle = Vehicle.where("license_plate = ?", params[:license_plate])

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 4 LIMIT 1
UPDATE `vehicles` SET `license_plate` = 'updated5457', `vehicle_type` = '110', `model` = 'updated updated 1651', `year` = 1969, `color` = 'climb516', `registry` = '2021-05-01 22:55:14', `picture` = 'residence 541685pitch', `capacity` = 3, `brand` = 'supply65441651 wing', `service_type` = 'harsh564181 church', `body` = 'large564451', `soat_exp` = '2012-09-26', `engine` = 1342, `gas_type` = 'gasoline', `updated_at` = '2021-04-28 18:56:59' WHERE `vehicles`.`id` = 1
---
    def update
      vehicle = Vehicle.find(params[:id])
      if vehicle.update(upd_params)

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 1 LIMIT 1
DELETE FROM `vehicles` WHERE `vehicles`.`id` = 1
---
    def destroy
      vehicle = Vehicle.find(params[:id])
      vehicle.destroy